Revit 2024 API
PanelScheduleData.ShowSlotFromDeviceInsteadOfTemplate Property
 When true, the number of rows in an instance will be the number of poles on the associated device, not a set number
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool ShowSlotFromDeviceInsteadOfTemplate { get; set; }
Visual Basic
Public Property ShowSlotFromDeviceInsteadOfTemplate As Boolean
	Get
	Set
Visual C++
public:
property bool ShowSlotFromDeviceInsteadOfTemplate {
	bool get ();
	void set (bool value);
}
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace